# RoomBasePowerLoadOnParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomBasePowerLoadOnParam Property
ParameterTypeId Class See Also
---
"Base Power Load on"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomBasePowerLoadOnParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomBasePowerLoadOnParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomBasePowerLoadOnParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace